### Pruebas con pandas: Series y DataFrame

In [3]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [2]:
s1 = Series([1,4,5,2,10])
s1

0     1
1     4
2     5
3     2
4    10
dtype: int64

In [5]:
s2 = Series(np.random.randint(1,50, 5), index=list('abcde'))
s2

a    38
b    16
c    33
d    33
e    18
dtype: int32

In [7]:
print(s2.iloc[0])
print(s2['a'])

38
38

In [8]:
(s2 > 30).sum()

3

In [9]:
s2 > 30

a     True
b    False
c     True
d     True
e    False
dtype: bool

In [10]:
s3 = Series(np.random.randint(1,40,5), index=list("aeiou"))
s3

a     8
e    21
i    32
o    29
u    24
dtype: int32

In [11]:
s2

a    38
b    16
c    33
d    33
e    18
dtype: int32

In [13]:
resul = s2 + s3
resul

a    46.0
b     NaN
c     NaN
d     NaN
e    39.0
i     NaN
o     NaN
u     NaN
dtype: float64

In [15]:
resul2 = s2.add(s3, fill_value=0)
resul2

a    46.0
b    16.0
c    33.0
d    33.0
e    39.0
i    32.0
o    29.0
u    24.0
dtype: float64

In [16]:
resul2[['a','b','u']]

a    46.0
b    16.0
u    24.0
dtype: float64

In [17]:
resul2.iloc[:5]

a    46.0
b    16.0
c    33.0
d    33.0
e    39.0
dtype: float64

In [18]:
resul2[resul2 > 30] = 30
resul2

a    30.0
b    16.0
c    30.0
d    30.0
e    30.0
i    30.0
o    29.0
u    24.0
dtype: float64

DataFrame

In [20]:
dicc = {key:np.random.randint(1,50, 8) for key in "abcde"}
df = DataFrame(dicc)
df

    a   b   c   d   e
0  29  24   2  24  45
1  17  38  11  25   4
2  35   4  18  24  40
3  43   9  17  43   8
4  24  35  39  49  34
5  36  37  17  21  39
6  35  44  31   8  18
7   2   6  17   1  19

In [21]:
df['c']

0     2
1    11
2    18
3    17
4    39
5    17
6    31
7    17
Name: c, dtype: int32

In [22]:
df['c'][2]

18

In [23]:
df.loc[2]

a    35
b     4
c    18
d    24
e    40
Name: 2, dtype: int32

In [24]:
df.loc[2]['c']

18

In [26]:
df2 = DataFrame(np.random.randint(1,50, (5,4)))
df2

    0   1   2   3
0   7  25  34  15
1  17  17  34   6
2  41  44  37  46
3  22  14  46  10
4  38  38  43  19

In [27]:
df2.columns = list('ABCD')
df2

    A   B   C   D
0   7  25  34  15
1  17  17  34   6
2  41  44  37  46
3  22  14  46  10
4  38  38  43  19

In [28]:
df2[['D','B','A']]

    D   B   A
0  15  25   7
1   6  17  17
2  46  44  41
3  10  14  22
4  19  38  38

In [29]:
df2[['D','B','A']][1:3]

    D   B   A
1   6  17  17
2  46  44  41

In [30]:
df2.loc[1:3][['D','B','A']]

    D   B   A
1   6  17  17
2  46  44  41
3  10  14  22